dazui0019/hlw_calibrate/middleware/libraries/gd32_drivers/drv_usart.c
/*
 * Copyright (c) 2006-2022, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2021-08-20     BruceOu      first implementation
 */

#include "drv_usart.h"

#ifdef RT_USING_SERIAL

#if !defined(BSP_USING_UART0) && !defined(BSP_USING_UART1) && \
    !defined(BSP_USING_UART2) && !defined(BSP_USING_UART3) && \
    !defined(BSP_USING_UART4) && !defined(BSP_USING_UART5) && \
    !defined(BSP_USING_UART6) && !defined(BSP_USING_UART7)
#error "Please define at least one UARTx"

#endif

#include <rtdevice.h>

#define LOG_TAG "drv.usart"
#define LOG_LVL LOG_LVL_DBG
#include <ulog.h>

static void GD32_UART_IRQHandler(struct rt_serial_device *serial);
static void GD32_UART_DMA_IRQHandler(struct rt_serial_device *serial);

#if defined(BSP_USING_UART0)
struct rt_serial_device serial0;

void USART0_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial0);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART0 */

#if defined(BSP_USING_UART1)
struct rt_serial_device serial1;

void USART1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial1);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART1 */

#if defined(BSP_USING_UART2)
struct rt_serial_device serial2;

void USART2_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial2);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART2 */

#if defined(BSP_USING_UART3)
struct rt_serial_device serial3;

void UART3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial3);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART3 */

#if defined(BSP_USING_UART4)
struct rt_serial_device serial4;

void UART4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial4);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_USING_UART4 */

#if defined(BSP_USING_UART5)
struct rt_serial_device serial5;

void USART5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial5);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART5 */

#if defined(BSP_USING_UART6)
struct rt_serial_device serial6;

void UART6_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial6);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART6 */

#if defined(BSP_USING_UART7)
struct rt_serial_device serial7;

void UART7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial7);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART7 */

#if defined(BSP_UART0_RX_USING_DMA)
void DMA1_Channel2_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_DMA_IRQHandler(&serial0);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(BSP_UART1_RX_USING_DMA) */

#if defined(BSP_UART0_TX_USING_DMA)
void DMA1_Channel7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_DMA_IRQHandler(&serial0);

    /* leave interrupt */
    rt_interrupt_leave();
}   
#endif /* defined(BSP_UART1_TX_USING_DMA) */

#if defined(BSP_UART1_RX_USING_DMA)
void DMA0_Channel5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_DMA_IRQHandler(&serial1);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(BSP_UART1_RX_USING_DMA) */

#if defined(BSP_UART2_RX_USING_DMA)
void DMA0_Channel1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_DMA_IRQHandler(&serial2);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(BSP_UART2_RX_USING_DMA) */

#if defined(BSP_UART2_TX_USING_DMA)
void DMA0_Channel3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_DMA_IRQHandler(&serial2);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(BSP_UART2_TX_USING_DMA) */

#if defined(BSP_UART7_RX_USING_DMA)
void DMA0_Channel6_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_DMA_IRQHandler(&serial7);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(BSP_UART1_RX_USING_DMA) */

#ifdef BSP_UART0_RX_USING_DMA
struct gd32_uart_dma uart0_rx_dma = {
    DMA1,
    DMA_CH2,
    DMA1_Channel2_IRQn,
    RCU_DMA1,
#if defined SOC_SERIES_GD32F4xx
    DMA_SUBPERI4,
#endif
    DMA_PRIORITY_ULTRA_HIGH,
    0
};
#endif

#ifdef BSP_UART0_TX_USING_DMA
struct gd32_uart_dma uart0_tx_dma = {
    DMA1,
    DMA_CH7,
    DMA1_Channel7_IRQn,
    RCU_DMA1,
#if defined SOC_SERIES_GD32F4xx
    DMA_SUBPERI4,
#endif
    DMA_PRIORITY_ULTRA_HIGH,
    0
};
#endif

#ifdef BSP_UART1_RX_USING_DMA
struct gd32_uart_dma uart1_rx_dma = {
    DMA0,
    DMA_CH5,
    DMA0_Channel5_IRQn,
    RCU_DMA0,
#if defined SOC_SERIES_GD32F4xx
    DMA_SUBPERI4,
#endif
    DMA_PRIORITY_ULTRA_HIGH,
    0
};
#endif

#ifdef BSP_UART1_TX_USING_DMA
struct gd32_uart_dma uart1_tx_dma = {
    DMA0,
    DMA_CH6,
    DMA0_Channel6_IRQn,
    RCU_DMA0,
#if defined SOC_SERIES_GD32F4xx
    DMA_SUBPERI4,
#endif
    DMA_PRIORITY_ULTRA_HIGH,
    0
};
#endif

#ifdef BSP_UART2_RX_USING_DMA
struct gd32_uart_dma uart2_rx_dma = {
    DMA0,
    DMA_CH1,
    DMA0_Channel1_IRQn,
    RCU_DMA0,
#if defined SOC_SERIES_GD32F4xx
    DMA_SUBPERI4,
#endif
    DMA_PRIORITY_ULTRA_HIGH,
    0
};
#endif

#ifdef BSP_UART2_TX_USING_DMA
struct gd32_uart_dma uart2_tx_dma = {
    DMA0,
    DMA_CH3,
    DMA0_Channel3_IRQn,
    RCU_DMA0,
#if defined SOC_SERIES_GD32F4xx
    DMA_SUBPERI4,
#endif
    DMA_PRIORITY_ULTRA_HIGH,
    0
};
#endif

#ifdef BSP_UART7_RX_USING_DMA
struct gd32_uart_dma uart7_rx_dma = {
    DMA0,
    DMA_CH6,
    DMA0_Channel6_IRQn,
    RCU_DMA0,
#if defined SOC_SERIES_GD32F4xx
    DMA_SUBPERI5,
#endif
    DMA_PRIORITY_ULTRA_HIGH,
    0
};
#endif

#ifdef BSP_UART7_TX_USING_DMA
struct gd32_uart_dma uart7_tx_dma = {
    DMA0,
    DMA_CH0,
    DMA0_Channel0_IRQn,
    RCU_DMA0,
#if defined SOC_SERIES_GD32F4xx
    DMA_SUBPERI5,
#endif
    DMA_PRIORITY_ULTRA_HIGH,
    0
};
#endif

