dazui0019/hlw_calibrate/middleware/libraries/gd32_drivers/drv_usart.c
static const struct gd32_uart uart_obj[] = {
    #ifdef BSP_USING_UART0
    {
        USART0,                                // uart peripheral index
        USART0_IRQn,                           // uart iqrn
        RCU_USART0,                            // uart periph clock
#if defined SOC_SERIES_GD32F4xx
        RCU_GPIOA, RCU_GPIOA,                  // tx gpio clock, rx gpio clock
        GPIOA, GPIO_AF_7, GPIO_PIN_9,          // tx port, tx alternate, tx pin
        GPIOA, GPIO_AF_7, GPIO_PIN_10,         // rx port, rx alternate, rx pin
#elif defined SOC_SERIES_GD32H7xx
        RCU_GPIOF,                             // periph clock, tx gpio clock
        RCU_GPIOF,                             // periph clock, rx gpio clock
        GPIOF, GPIO_AF_4, GPIO_PIN_4,          // tx port, tx alternate, tx pin
        GPIOF, GPIO_AF_4, GPIO_PIN_5,          // rx port, rx alternate, rx pin
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOA, RCU_GPIOA,                  // tx gpio clock, rx gpio clock
        GPIOA, 0, GPIO_PIN_9,                  // tx port, tx alternate, tx pin
        GPIOA, 0, GPIO_PIN_10,                 // rx port, rx alternate, rx pin
        0,                                     // afio remap cfg
#else
        RCU_GPIOA, RCU_GPIOA,                  // tx gpio clock, rx gpio clock
        GPIOA, GPIO_PIN_9,                     // tx port, tx pin
        GPIOA, GPIO_PIN_10,                    // rx port, rx pin
#endif
#if defined RT_SERIAL_USING_DMA
        RT_DEVICE_FLAG_DMA_RX,
        DMA_CHXCTL_FTFIE | DMA_CHXCTL_HTFIE,
#endif
#if defined BSP_UART0_RX_USING_DMA
        &uart0_rx_dma,
#else
        NULL,
#endif
#if defined BSP_UART0_TX_USING_DMA
        &uart0_tx_dma,
#else
        NULL,
#endif
        &serial0,
        "uart0",
    },
    #endif

    #ifdef BSP_USING_UART1
    {
        USART1,                                 // uart peripheral index
        USART1_IRQn,                            // uart iqrn
        RCU_USART1,                             // uart periph clock
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32H7xx
        RCU_GPIOD, RCU_GPIOD,                   // tx gpio clock, rx gpio clock
        GPIOD, GPIO_AF_7, GPIO_PIN_5,           // tx port, tx alternate, tx pin
        GPIOD, GPIO_AF_7, GPIO_PIN_6,           // rx port, rx alternate, rx pin
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOA, RCU_GPIOA,                   // tx gpio clock, rx gpio clock
        GPIOA, 0, GPIO_PIN_2,                   // tx port, tx alternate, tx pin
        GPIOA, 0, GPIO_PIN_3,                   // rx port, rx alternate, rx pin
        0,                                      // afio remap cfg
#else
        RCU_GPIOA, RCU_GPIOA,                   // periph clock, tx gpio clock, rt gpio clock
        GPIOA, GPIO_PIN_2,                      // tx port, tx pin
        GPIOA, GPIO_PIN_3,                      // rx port, rx pin
#endif
#if defined RT_SERIAL_USING_DMA
        RT_DEVICE_FLAG_DMA_RX,
        DMA_CHXCTL_FTFIE | DMA_CHXCTL_HTFIE,
#endif
#if defined BSP_UART1_RX_USING_DMA
        &uart1_rx_dma,
#else
        NULL,
#endif
#if defined BSP_UART1_TX_USING_DMA
        &usart1_tx_dma,
#else
        NULL,
#endif
        &serial1,
        "uart1",
    },
    #endif

    #ifdef BSP_USING_UART2
    {
        USART2,                                 // uart peripheral index
        USART2_IRQn,                            // uart iqrn
        RCU_USART2,                                    // uart periph clock
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32H7xx
        RCU_GPIOD, RCU_GPIOD,                   // tx gpio clock, rt gpio clock
        GPIOD, GPIO_AF_7, GPIO_PIN_8,           // tx port, tx alternate, tx pin
        GPIOD, GPIO_AF_7, GPIO_PIN_9,           // rx port, rx alternate, rx pin
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOB, RCU_GPIOB,                   // tx gpio clock, rx gpio clock
        GPIOB, 0, GPIO_PIN_10,                  // tx port, tx alternate, tx pin
        GPIOB, 0, GPIO_PIN_11,                  // rx port, rx alternate, rx pin
        0,                                      // afio remap cfg
#else
        RCU_GPIOB, RCU_GPIOB,                   // tx gpio clock, rt gpio clock
        GPIOB, GPIO_PIN_10,                     // tx port, tx pin
        GPIOB, GPIO_PIN_11,                     // rx port, rx pin
#endif
#if defined RT_SERIAL_USING_DMA
        RT_DEVICE_FLAG_DMA_RX,
        DMA_CHXCTL_FTFIE | DMA_CHXCTL_HTFIE,
#endif
#if defined BSP_UART2_RX_USING_DMA
        &uart2_rx_dma,
#else
        NULL,
#endif
#if defined BSP_UART2_TX_USING_DMA
        &uart2_tx_dma,
#else
        NULL,
#endif
        &serial2,
        "uart2",
    },
    #endif

    #ifdef BSP_USING_UART3
    {
        UART3,                                 // uart peripheral index
        UART3_IRQn,                            // uart iqrn
        RCU_UART3,                             // uart periph clock
#if defined SOC_SERIES_GD32F4xx
        RCU_GPIOC, RCU_GPIOC,                  // tx gpio clock, rt gpio clock
        GPIOC, GPIO_AF_8, GPIO_PIN_10,         // tx port, tx alternate, tx pin
        GPIOC, GPIO_AF_8, GPIO_PIN_11,         // rx port, rx alternate, rx pin
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOC, RCU_GPIOC,                   // tx gpio clock, rx gpio clock
        GPIOC, 0, GPIO_PIN_10,                  // tx port, tx alternate, tx pin
        GPIOC, 0, GPIO_PIN_11,                  // rx port, rx alternate, rx pin
        0,                                      // afio remap cfg
#else
        RCU_GPIOC, RCU_GPIOC,                  // periph clock, tx gpio clock, rt gpio clock
        GPIOC, GPIO_PIN_10,                    // tx port, tx pin
        GPIOC, GPIO_PIN_11,                    // rx port, rx pin
#endif
#if defined RT_SERIAL_USING_DMA
        RT_DEVICE_FLAG_DMA_RX,
        DMA_CHXCTL_FTFIE | DMA_CHXCTL_HTFIE,
#endif
#if defined BSP_UART3_RX_USING_DMA
        &usart3_rx_dma,
#else
        NULL,
#endif
#if defined BSP_UART3_TX_USING_DMA
        &usart3_tx_dma,
#else
        NULL,
#endif
        &serial3,
        "uart3",
    },
    #endif

    #ifdef BSP_USING_UART4
    {
        UART4,                                 // uart peripheral index
        UART4_IRQn,                            // uart iqrn
        RCU_UART4, RCU_GPIOC, RCU_GPIOD,       // periph clock, tx gpio clock, rt gpio clock
#if defined SOC_SERIES_GD32F4xx
        GPIOC, GPIO_AF_8, GPIO_PIN_12,         // tx port, tx alternate, tx pin
        GPIOD, GPIO_AF_8, GPIO_PIN_2,          // rx port, rx alternate, rx pin
#elif defined SOC_SERIES_GD32E50x
        GPIOC, 0, GPIO_PIN_12,                 // tx port, tx alternate, tx pin
        GPIOD, 0, GPIO_PIN_2,                  // rx port, rx alternate, rx pin
        0,                                     // afio remap cfg
#else
        GPIOC, GPIO_PIN_12,                    // tx port, tx pin
        GPIOD, GPIO_PIN_2,                     // rx port, rx pin
#endif
#if defined RT_SERIAL_USING_DMA
        RT_DEVICE_FLAG_DMA_RX,
        DMA_CHXCTL_FTFIE | DMA_CHXCTL_HTFIE,
#endif
#if defined BSP_UART4_RX_USING_DMA
        &usart4_rx_dma,
#else
        NULL,
#endif
#if defined BSP_UART4_TX_USING_DMA
        &usart4_tx_dma,
#else
        NULL,
#endif
        &serial4,
        "uart4",
    },
    #endif

    #ifdef BSP_USING_UART5
    {
        USART5,                                 // uart peripheral index
        USART5_IRQn,                            // uart iqrn
        RCU_USART5,                             // periph clock
#if defined SOC_SERIES_GD32F4xx
        RCU_GPIOA, RCU_GPIOA,                    // tx gpio clock, rt gpio clock
        GPIOA, GPIO_AF_8, GPIO_PIN_11,           // tx port, tx alternate, tx pin
        GPIOA, GPIO_AF_8, GPIO_PIN_12,           // rx port, rx alternate, rx pin
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOC, RCU_GPIOC,                    // tx gpio clock, rt gpio clock
        GPIOC, AFIO_PC6_USART5_CFG, GPIO_PIN_6, // tx port, tx alternate, tx pin
        GPIOC, AFIO_PC7_USART5_CFG, GPIO_PIN_7, // rx port, rx alternate, rx pin
        0,                                      // afio remap cfg
#else
        RCU_GPIOC, RCU_GPIOC,                    // tx gpio clock, rt gpio clock
        GPIOC, GPIO_PIN_6,                      // tx port, tx pin
        GPIOC, GPIO_PIN_7,                      // rx port, rx pin
#endif
#if defined RT_SERIAL_USING_DMA
        RT_DEVICE_FLAG_DMA_RX,
        DMA_CHXCTL_FTFIE | DMA_CHXCTL_HTFIE,
#endif
#if defined BSP_UART5_RX_USING_DMA
        &usart5_rx_dma,
#else
        NULL,
#endif
#if defined BSP_UART5_TX_USING_DMA
        &usart5_tx_dma,
#else
        NULL,
#endif
        &serial5,
        "uart5",
    },
    #endif

    #ifdef BSP_USING_UART6
    {
        UART6,                                 // uart peripheral index
        UART6_IRQn,                            // uart iqrn
        RCU_UART6, RCU_GPIOE, RCU_GPIOE,       // periph clock, tx gpio clock, rt gpio clock
#if defined SOC_SERIES_GD32F4xx
        GPIOE, GPIO_AF_8, GPIO_PIN_7,          // tx port, tx alternate, tx pin
        GPIOE, GPIO_AF_8, GPIO_PIN_8,          // rx port, rx alternate, rx pin
#else
        GPIOE, GPIO_PIN_7,                     // tx port, tx pin
        GPIOE, GPIO_PIN_8,                     // rx port, rx pin
#endif
#if defined RT_SERIAL_USING_DMA
        RT_DEVICE_FLAG_DMA_RX,
        DMA_CHXCTL_FTFIE | DMA_CHXCTL_HTFIE,
#endif
#if defined BSP_UART6_RX_USING_DMA
        &usart6_rx_dma,
#else
        NULL,
#endif
#if defined BSP_UART6_TX_USING_DMA
        &usart6_tx_dma,
#else
        NULL,
#endif
        &serial6,
        "uart6",
    },
    #endif

    #ifdef BSP_USING_UART7
    {
        UART7,                                 // uart peripheral index
        UART7_IRQn,                            // uart iqrn
        RCU_UART7, RCU_GPIOE, RCU_GPIOE,       // periph clock, tx gpio clock, rt gpio clock
#if defined SOC_SERIES_GD32F4xx
        GPIOE, GPIO_AF_8, GPIO_PIN_0,          // tx port, tx alternate, tx pin
        GPIOE, GPIO_AF_8, GPIO_PIN_1,          // rx port, rx alternate, rx pin
#else
        GPIOE, GPIO_PIN_0,                     // tx port, tx pin
        GPIOE, GPIO_PIN_1,                     // rx port, rx pin
#endif
#if defined RT_SERIAL_USING_DMA
        RT_DEVICE_FLAG_DMA_RX,
        DMA_CHXCTL_HTFIE,
#endif
#if defined BSP_UART7_RX_USING_DMA
        &uart7_rx_dma,
#else
        NULL,
#endif
#if defined BSP_UART7_TX_USING_DMA
        &usart7_tx_dma,
#else
        NULL,
#endif
        &serial7,
        "uart7",
    },
    #endif
};


/**
* @brief UART MSP Initialization
*        This function configures the hardware resources used in this example:
*           - Peripheral's clock enable
*           - Peripheral's GPIO Configuration
*           - NVIC configuration for UART interrupt request enable
* @param huart: UART handle pointer
* @retval None
*/
void gd32_uart_gpio_init(struct gd32_uart *uart)
{
    /* enable USART clock */
    rcu_periph_clock_enable(uart->tx_gpio_clk);
    rcu_periph_clock_enable(uart->rx_gpio_clk);
    rcu_periph_clock_enable(uart->per_clk);

