dazui0019/hlw_calibrate/middleware/libraries/gd32_drivers/drv_usart.c
#if defined SOC_SERIES_GD32F4xx
    /* connect port to USARTx_Tx */
    gpio_af_set(uart->tx_port, uart->tx_af, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_af_set(uart->rx_port, uart->rx_af, uart->rx_pin);

    /* configure USART Tx as alternate function push-pull */
    gpio_mode_set(uart->tx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->tx_pin);
    gpio_output_options_set(uart->tx_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, uart->tx_pin);

    /* configure USART Rx as alternate function push-pull */
    gpio_mode_set(uart->rx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->rx_pin);
    gpio_output_options_set(uart->rx_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, uart->rx_pin);

#elif defined SOC_SERIES_GD32H7xx
    /* connect port to USARTx_Tx */
    gpio_af_set(uart->tx_port, uart->tx_af, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_af_set(uart->rx_port, uart->rx_af, uart->rx_pin);

    /* configure USART Tx as alternate function push-pull */
    gpio_mode_set(uart->tx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->tx_pin);
    gpio_output_options_set(uart->tx_port, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, uart->tx_pin);

    /* configure USART Rx as alternate function push-pull */
    gpio_mode_set(uart->rx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->rx_pin);
    gpio_output_options_set(uart->rx_port, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, uart->rx_pin);

#elif defined SOC_SERIES_GD32E50x
    /* configure remap function */
    if (uart->uart_remap != 0 || uart->tx_af != 0 || uart->rx_af != 0)
    {
        rcu_periph_clock_enable(RCU_AF);
        gpio_pin_remap_config(uart->uart_remap, ENABLE);
    }

    /* connect port to USARTx_Tx */
    gpio_init(uart->tx_port, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_init(uart->rx_port, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, uart->rx_pin);

    /* configure alternate1 function */
    if (uart->tx_af != 0 || uart->rx_af != 0)
    {
        rcu_periph_clock_enable(RCU_AF);
        gpio_afio_port_config(uart->tx_af, ENABLE);
        gpio_afio_port_config(uart->rx_af, ENABLE);
    }

#else
    /* connect port to USARTx_Tx */
    gpio_init(uart->tx_port, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_init(uart->rx_port, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, uart->rx_pin);
#endif

    NVIC_SetPriority(uart->irqn, 0);
    NVIC_EnableIRQ(uart->irqn);
}

/**
  * @brief  uart configure
  * @param  serial, cfg
  * @retval None
  */
static rt_err_t gd32_uart_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

    uart = (struct gd32_uart *)serial->parent.user_data;

    gd32_uart_gpio_init(uart);

    usart_baudrate_set(uart->uart_periph, cfg->baud_rate);

    switch (cfg->data_bits)
    {
    case DATA_BITS_9:
        usart_word_length_set(uart->uart_periph, USART_WL_9BIT);
        break;

    default:
        usart_word_length_set(uart->uart_periph, USART_WL_8BIT);
        break;
    }

    switch (cfg->stop_bits)
    {
    case STOP_BITS_2:
        usart_stop_bit_set(uart->uart_periph, USART_STB_2BIT);
        break;
    default:
        usart_stop_bit_set(uart->uart_periph, USART_STB_1BIT);
        break;
    }

    switch (cfg->parity)
    {
    case PARITY_ODD:
        usart_parity_config(uart->uart_periph, USART_PM_ODD);
        break;
    case PARITY_EVEN:
        usart_parity_config(uart->uart_periph, USART_PM_EVEN);
        break;
    default:
        usart_parity_config(uart->uart_periph, USART_PM_NONE);
        break;
    }

    usart_receive_config(uart->uart_periph, USART_RECEIVE_ENABLE);
    usart_transmit_config(uart->uart_periph, USART_TRANSMIT_ENABLE);
    usart_enable(uart->uart_periph);

    return RT_EOK;
}

#if defined(RT_SERIAL_USING_DMA) 
static void gd32_rx_dma_config(struct gd32_uart *uart)
{                    
    RT_ASSERT(uart != RT_NULL);
    
    struct rt_serial_rx_fifo *rx_fifo;
    
    rx_fifo = (struct rt_serial_rx_fifo *)uart->serial->serial_rx;
    
    dma_single_data_parameter_struct dma_init_struct;
    
    if(uart->dma_rx != 0){
        /* enable DMA */
        rcu_periph_clock_enable(uart->dma_rx->per_clk);  
        
        /* USART DMA enable for reception */
        usart_dma_receive_config(uart->uart_periph, USART_RECEIVE_DMA_ENABLE);
        
        /* deinitialize DMA channel */
        dma_deinit(uart->dma_rx->dma_periph, uart->dma_rx->channel);
        
        /* set the DMA struct */
        dma_init_struct.direction = DMA_PERIPH_TO_MEMORY;
        dma_init_struct.memory0_addr = (uint32_t)(rx_fifo->buffer);
        dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
        dma_init_struct.number = uart->serial->config.bufsz;
        dma_init_struct.periph_addr = (uint32_t)&USART_DATA(uart->uart_periph);
        dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
        dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
        dma_init_struct.priority = uart->dma_rx->priority;
            
        dma_single_data_mode_init(uart->dma_rx->dma_periph, uart->dma_rx->channel, &dma_init_struct);
            
        /* configure DMA mode */
        dma_circulation_enable(uart->dma_rx->dma_periph, uart->dma_rx->channel); 
        dma_channel_subperipheral_select(uart->dma_rx->dma_periph, uart->dma_rx->channel, uart->dma_rx->subperipheral);

        /* enable DMA channel */
        dma_channel_enable(uart->dma_rx->dma_periph, uart->dma_rx->channel);
        
        /* enable rx irq */
        NVIC_EnableIRQ(uart->irqn);
        /* enable interrupt */
        usart_interrupt_enable(uart->uart_periph, USART_INT_IDLE);

        /* enable DMA rx irq */
        NVIC_EnableIRQ(uart->dma_rx->dma_irqn);
        /* enable DMA full transfer finish interrupt */
        dma_interrupt_enable(uart->dma_rx->dma_periph, uart->dma_rx->channel, uart->dma_int_type);
        
        uart->dma_rx->last_index = 0;
    }
}
#endif

/**
  * @brief  uart control
  * @param  serial, arg
  * @retval None
  */
static rt_err_t gd32_uart_control(struct rt_serial_device *serial, int cmd, void *arg)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct gd32_uart *)serial->parent.user_data;
    rt_ubase_t ctrl_arg = (rt_ubase_t)arg;

