dazui0019/hlw_calibrate/middleware/libraries/gd32_drivers/drv_usart.c
    switch (cmd)
    {
    /* disable interrupt */
    case RT_DEVICE_CTRL_CLR_INT:
        /* disable rx irq */
        NVIC_DisableIRQ(uart->irqn);
        /* disable interrupt */
        usart_interrupt_disable(uart->uart_periph, USART_INT_RBNE);
    #if defined(RT_SERIAL_USING_DMA)
        if (uart->dma_rx != RT_NULL){
            /* disable dma irq */
            NVIC_DisableIRQ(uart->dma_rx->dma_irqn);
            dma_channel_disable(uart->dma_rx->dma_periph, uart->dma_rx->channel);
            dma_deinit(uart->dma_rx->dma_periph, uart->dma_rx->channel);
        }
    #endif
        break;
    /* enable interrupt */
    case RT_DEVICE_CTRL_SET_INT:
        /* enable rx irq */
        NVIC_EnableIRQ(uart->irqn);
        /* enable interrupt */
        usart_interrupt_enable(uart->uart_periph, USART_INT_RBNE);
        break;
    #if defined(RT_SERIAL_USING_DMA)
    case RT_DEVICE_CTRL_CONFIG:
        if (RT_DEVICE_FLAG_DMA_RX == ctrl_arg){
            gd32_rx_dma_config(uart);
        }else{
            gd32_uart_configure(serial, (struct serial_configure*)arg);
        }
        break;
	#endif
    }

    return RT_EOK;
}

/**
  * @brief  uart put char
  * @param  serial, ch
  * @retval None
  */
static int gd32_uart_putc(struct rt_serial_device *serial, char ch)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct gd32_uart *)serial->parent.user_data;

    usart_data_transmit(uart->uart_periph, ch);
    while((usart_flag_get(uart->uart_periph, USART_FLAG_TBE) == RESET));

    return RT_EOK;
}

/**
  * @brief  uart get char
  * @param  serial
  * @retval None
  */
static int gd32_uart_getc(struct rt_serial_device *serial)
{
    int ch;
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct gd32_uart *)serial->parent.user_data;

    ch = -1;
    if (usart_flag_get(uart->uart_periph, USART_FLAG_RBNE) != RESET)
        ch = usart_data_receive(uart->uart_periph);
    return ch;
}


/**
 * @brief       串口空闲中断和DMA中断回调函数
 * @note        串口和DMA中断都会调用该函数, 用来处理DMA缓冲区里面的数据。
 * @param[in]   size dma缓冲区已经使用的大小, 如果传入0, 则代表是空闲中断调用的
*/
#if defined(RT_SERIAL_USING_DMA)
void COMM_RxEventCallback(struct rt_serial_device *serial, uint32_t Size)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    RT_ASSERT(uart != RT_NULL);

    static uint32_t Rx_length = 0;      //  本次收到的数据长度

    Rx_length = Size - uart->dma_rx->last_index;

    rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_DMADONE|(Rx_length << 8));

    uart->dma_rx->last_index += Rx_length;

    if (uart->dma_rx->last_index >= uart->serial->config.bufsz) uart->dma_rx->last_index = 0;
}
#endif

/**
 * Uart common interrupt process. This need add to uart ISR.
 *
 * @param serial serial device
 */
static void GD32_UART_IRQHandler(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    RT_ASSERT(uart != RT_NULL);

    /* UART in mode Receiver -------------------------------------------------*/
    if ((usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_RBNE) != RESET) &&
            (usart_flag_get(uart->uart_periph, USART_FLAG_RBNE) != RESET))
    {
        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_IND);
        /* Clear RXNE interrupt flag */
        usart_flag_clear(uart->uart_periph, USART_FLAG_RBNE);
    }
#if defined(RT_SERIAL_USING_DMA)
    if(usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_IDLE) != RESET){
        USART_STAT0(uart->uart_periph);
        USART_DATA(uart->uart_periph);
        COMM_RxEventCallback(serial, (uart->serial->config.bufsz - (uint32_t)DMA_CHCNT(uart->dma_rx->dma_periph, uart->dma_rx->channel)));
    }
#endif
}

#if defined(RT_SERIAL_USING_DMA)
static void GD32_UART_DMA_IRQHandler(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    RT_ASSERT(uart != RT_NULL);

    /* UART in mode Receiver -------------------------------------------------*/
    if(dma_interrupt_flag_get(uart->dma_rx->dma_periph, uart->dma_rx->channel, DMA_INTF_FTFIF)){
        dma_interrupt_flag_clear(uart->dma_rx->dma_periph, uart->dma_rx->channel, DMA_INTF_FTFIF);
        COMM_RxEventCallback(serial, uart->serial->config.bufsz);
    }else if(dma_interrupt_flag_get(uart->dma_rx->dma_periph, uart->dma_rx->channel, DMA_INTF_HTFIF)){
        dma_interrupt_flag_clear(uart->dma_rx->dma_periph, uart->dma_rx->channel, DMA_INTF_HTFIF);
        COMM_RxEventCallback(serial, (uart->serial->config.bufsz)/2);
    }
}
#endif

static const struct rt_uart_ops gd32_uart_ops =
{
    .configure = gd32_uart_configure,
    .control = gd32_uart_control,
    .putc = gd32_uart_putc,
    .getc = gd32_uart_getc,
    RT_NULL,
};

/**
  * @brief  uart init
  * @param  None
  * @retval None
  */
int rt_hw_usart_init(void)
{
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;
    int i;

    int result;

    for (i = 0; i < sizeof(uart_obj) / sizeof(uart_obj[0]); i++)
    {
        uart_obj[i].serial->ops    = &gd32_uart_ops;
        uart_obj[i].serial->config = config;

        /* register UART1 device */
        result = rt_hw_serial_register(uart_obj[i].serial,
                              uart_obj[i].device_name,
                              RT_DEVICE_FLAG_RDWR
                              #if defined RT_SERIAL_USING_DMA
                              | uart_obj[i].uart_dma_flag
                              #endif
                              | RT_DEVICE_FLAG_INT_RX, // MSH组件会以RT_DEVICE_FLAG_INT_RX方式打开串口
                              (void *)&uart_obj[i]);
        RT_ASSERT(result == RT_EOK);
    }

    return result;
}

#endif
